
// ”Âê

#include "stage_result.h"


// Ctor, Dtor
/*===========================================================================*/
StageResult::StageResult( const Info ClearInfo )
{

}

StageResult::~StageResult()
{

}


/*===========================================================================*/
// ‰Šú‰»ˆ—
bool StageResult::init()
{



    return true;
}


/*===========================================================================*/
void StageResult::destroy()
{

}


/*===========================================================================*/
SceneBase* StageResult::update()
{
    return this;
}


/*===========================================================================*/
void StageResult::draw()
{

}
